brew "antidote" # zsh plugin manager
brew "bat" # easier file viewer https://github.com/sharkdp/bat
brew "bat-extras" # Includes scripts that integrate bat with other cmdline tools like man.
brew "delta" # Better git diffs https://github.com/dandavison/delta
brew "eza" # easier ls https://github.com/eza-community/eza
brew "fd" # easier finder https://github.com/sharkdp/fd
brew "fzf" # fuzzy finder https://github.com/junegunn/fzf
brew "go" # Needed to isntall sqls.
brew "hyperfine" # execution times https://github.com/sharkdp/hyperfine
brew "jenv"
brew "json5"
brew "neovim-qt"
brew "pastel" # https://github.com/sharkdp/pastel
brew "ripgrep" # easier content search https://github.com/BurntSushi/ripgrep
brew "sad" # Batch file editor, sed with preview
brew "sd" # https://github.com/chmln/sd
brew "shellcheck" # bash linter
brew "thefuck" # typo corrector
brew "trash-cli" # undo-able file deletes https://github.com/andreafrancia/trash-cli
brew "watchexec" # file watcher https://github.com/watchexec/watchexec

tap "coursier/formulas"
brew "coursier/formulas/coursier"

cask "enpass"
cask "firefox"
cask "font-hasklug-nerd-font" # my font of choice
cask "google-chrome"
cask "slack"
cask "spotify"
cask "iterm2"
